---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyIsMultidayStudyType
source: html/d2ba855e-aebf-018a-1fb9-3317b1f26aae.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyIsMultidayStudyType Property

"Multi-day study"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewSolarstudyIsMultidayStudyType { get; }
```